CSI API ETABS v1

# cAnalysisResultsSetupSetOptionBaseReactLoc Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetOptionBaseReactLoc(
    	double GX,
    	double GY,
    	double GZ
    )

    Function SetOptionBaseReactLoc (
    	GX As Double,
    	GY As Double,
    	GZ As Double
    ) As Integer

    Dim instance As cAnalysisResultsSetup
    Dim GX As Double
    Dim GY As Double
    Dim GZ As Double
    Dim returnValue As Integer

    returnValue = instance.SetOptionBaseReactLoc(GX,
    	GY, GZ)

    int SetOptionBaseReactLoc(
    	double GX,
    	double GY,
    	double GZ
    )

    abstract SetOptionBaseReactLoc :
            GX : float *
            GY : float *
            GZ : float -> int

#### Parameters

GX

    Type: SystemDouble

GY

    Type: SystemDouble

GZ

    Type: SystemDouble

#### Return Value

Type: Int32

See Also

#### Reference

cAnalysisResultsSetup Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com